---
kind: type
id: T:Autodesk.Revit.DB.IUpdater
source: html/4cdaf502-fc25-8f18-7618-8448cce33d11.htm
---
# Autodesk.Revit.DB.IUpdater

The interface used to create an updater capable of reacting to changes in the Revit model.

## Syntax (C#)
```csharp
public interface IUpdater
```

## Remarks
Implement this interface and register an instance of the derived class with the UpdaterRegistry.